Show / Hide Table of Contents
Class StrainLoadOnLine
Linearly distributed generalized strain load along a line. Strain load is in local coordinate system and there are no possible eccentricities.
Inheritance
System.Object
OpenObject
OpenElementId
StrainLoadOnLine
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.StrainLoadOnLine,CI.Loading", "CI.StructModel.Loading.IStrainLoadOnLine,CI.BasicTypes")]
public class StrainLoadOnLine : OpenElementId
Examples
This sample shows how to create a strain load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
	/Uniform strain load on line1 - relative between 0.5-1.0. epsX = -0.0002
StrainLoadOnLine strainLoadLine = new StrainLoadOnLine();
strainLoadLine.Bimp = new StrainImpulse() { EpsX = -2e-4 };
strainLoadLine.Eimp = new StrainImpulse() { EpsX = -2e-4 };
strainLoadLine.GeometryPolyLine = new ReferenceElement(line1);
strainLoadLine.RelativeBeginPosition = 0.5;
strainLoadLine.RelativeBeginPosition = 1.0;
openModel.AddObject(strainLoadLine);
loadCase.StrainLoadsOnLine.Add(new ReferenceElement(strainLoadLine));
Constructors
Improve this Doc   View Source
StrainLoadOnLine()
Constructor
Declaration
public StrainLoadOnLine()
Properties
Improve this Doc   View Source
Bimp
Gets or sets the strain impulse at the begin position.
Declaration
public StrainImpulse Bimp { get; set; }
Property Value
 Type |  Description
 StrainImpulse
Improve this Doc   View Source
Eimp
Gets or sets the strain impulse at the end position.
Declaration
public StrainImpulse Eimp { get; set; }
Property Value
 Type |  Description
 StrainImpulse
Improve this Doc   View Source
Geometry
PolyLine3D or Segment3D
Declaration
[OpenModelProperty("GeometryPolyLine")]
public ReferenceElement Geometry { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
RelativeBeginPosition
Beginnig position on ISegment3D
Declaration
public double RelativeBeginPosition { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
RelativeEndPosition
End position on ISegment3D
Declaration
public double RelativeEndPosition { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source